### Cleaning the migration dataset through SQL

In [1]:
# Python SQL toolkit and Object Relational Mapper
import pandas as pd
from sqlalchemy import create_engine
import json

### Store CSV into DataFrame
Migration dataset source: https://www.kaggle.com/finnegannguyen/statetostate-migration-flows-from-2010-to-2019
From there, grab unique current states and get lat and lon through a gmap request

In [2]:
csv_file_state = "Resources/data/state_coord.csv"
state_coord = pd.read_csv(csv_file_state)
state_coord.head()

        state        lat         lng
0     Alabama  32.318231  -86.902298
1      Alaska  64.200841 -149.493673
2     Arizona  34.048928 -111.093731
3    Arkansas  35.201050  -91.831833
4  California  36.778261 -119.417932

In [3]:
# import the migration file
migration_file = "Resources/data/data_raw.csv"
migration_df = pd.read_csv(migration_file)
migration_df.head()

,current_state,year,population,same_house,same_state,from_different_state_Total,abroad_Total,from,number_of_people
0,Alabama,2010,4729509,3987155,620465,108723,13166,Alabama,0
1,Alaska,2010,702974,565031,95878,36326,5739,Alabama,477
2,Arizona,2010,6332786,5069002,1001991,222725,39068,Alabama,416
3,Arkansas,2010,2888304,2387806,412997,79127,8374,Alabama,1405
4,California,2010,36907897,30790221,5413287,444749,259640,Alabama,3364

In [4]:
# get only the columns needed
migration_df = migration_df[['current_state', 'year', 'population','from','number_of_people']].copy()

In [5]:
# rename the columns
migration_df = migration_df.rename(columns={"current_state": "destination", "from": "origin", "number_of_people": "total"})
migration_df.head()

  destination  year  population   origin  total
0     Alabama  2010     4729509  Alabama      0
1      Alaska  2010      702974  Alabama    477
2     Arizona  2010     6332786  Alabama    416
3    Arkansas  2010     2888304  Alabama   1405
4  California  2010    36907897  Alabama   3364

In [6]:
# find the unique states, to ensure that there is a match with foreign key
migration_df['origin'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia ',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'abroad_PuertoRico',
       'abroad_USIslandArea', 'abroad_ForeignCountry'], dtype=object)

In [7]:
#include only list where state has coordinates from the other csv file
inc_list = state_coord['state'].tolist()

In [8]:
migration_df = migration_df[migration_df['origin'].isin(inc_list)]
migration_df['origin'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia ',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

### Connect to local database

In [9]:
rds_connection_string = "postgres:postgres@localhost:5432/project_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [10]:
# Confirm tables
engine.table_names()

<ipython-input-10-2d97e9123e98>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['states_coord', 'migration_table']

### Load the Datasets

In [11]:
state_coord.to_sql(name='states_coord', con=engine, if_exists='append', index=False)

In [12]:
migration_df.to_sql(name='migration_table', con=engine, if_exists='append', index=False)

### Confirm data has been added

In [13]:
sql_one = pd.read_sql_query('select * from states_coord', con=engine)
sql_one = pd.DataFrame(sql_one)

In [14]:
sql_two = pd.read_sql_query('select * from migration_table', con=engine)
sql_two = pd.DataFrame(sql_two)

### Use sql data to clean and filter in jupyter

In [15]:
migration_merged = sql_two.merge(sql_one, left_on='destination', right_on='state',
          suffixes=('_left', '_right'))
migration_merged = migration_merged.drop(['state'], axis=1)
migration_merged = migration_merged.rename(columns={"lat": "destination_lat", "lng": "destination_lng"})

In [16]:
migration_merged = migration_merged.merge(sql_one, left_on='origin', right_on='state',
          suffixes=('_left', '_right'))
migration_merged = migration_merged.drop(['state'], axis=1)
migration_merged = migration_merged.rename(columns={"lat": "origin_lat", "lng": "origin_lng"})

In [17]:
# migration_merged = migration_merged.re_index()
migration_merged

,destination,year,population,origin,total,destination_lat,destination_lng,origin_lat,origin_lng
0,Alabama,2010,4729509,Alabama,0,32,-87,32,-87
1,Alabama,2011,4745278,Alabama,0,32,-87,32,-87
2,Alabama,2012,4764428,Alabama,0,32,-87,32,-87
3,Alabama,2013,4781296,Alabama,0,32,-87,32,-87
4,Alabama,2014,4791931,Alabama,0,32,-87,32,-87
...,...,...,...,...,...,...,...,...,...
26515,Puerto Rico,2015,3443445,Wyoming,0,18,-67,43,-107
26516,Puerto Rico,2016,3384760,Wyoming,0,18,-67,43,-107
26517,Puerto Rico,2017,3313519,Wyoming,0,18,-67,43,-107
26518,Puerto Rico,2018,3173956,Wyoming,0,18,-67,43,-107
26519,Puerto Rico,2019,3175835,Wyoming,0,18,-67,43,-107

In [18]:
migration_merged.to_json("Resources/data/migration_merged.json")

In [19]:
grouped_migration = migration_merged[['year','total']]
grouped_migration = grouped_migration.groupby(['year']).sum()
grouped_migration = grouped_migration.reset_index()

In [20]:
grouped_migration

   year    total
0  2010  6774961
1  2011  7010065
2  2012  7090389
3  2013  7231985
4  2014  7353940
5  2015  7554891
6  2016  7573732
7  2017  7491660
8  2018  7592182
9  2019  7429481

In [21]:
difference = grouped_migration.diff()
difference

   year     total
0   NaN       NaN
1   1.0  235104.0
2   1.0   80324.0
3   1.0  141596.0
4   1.0  121955.0
5   1.0  200951.0
6   1.0   18841.0
7   1.0  -82072.0
8   1.0  100522.0
9   1.0 -162701.0

In [22]:
change = pd.DataFrame((difference['total']/grouped_migration['total'])*100)
change = change.rename(columns={"total": "change"})
change = change.cumsum()

In [23]:
grouped_migration = pd.concat([grouped_migration, change], axis=1)

In [24]:
grouped_migration

   year    total     change
0  2010  6774961        NaN
1  2011  7010065   3.353806
2  2012  7090389   4.486664
3  2013  7231985   6.444577
4  2014  7353940   8.102940
5  2015  7554891  10.762819
6  2016  7573732  11.011587
7  2017  7491660   9.916076
8  2018  7592182  11.240095
9  2019  7429481   9.050158

In [25]:
grouped_migration.to_json("Resources/data/grouped_migration.json")